# task 1
# text = 'Ми зосереджені та енергійні перед матчем з! Леванте. Для нас це є ключова гра. Продовжити боротьбу за чемпіонство та зіграти на Сантьяго Бернабеу – це велика? мотивація. Хочемо провести чудовий матч. На базу зазвичай приходжу рано. Тут багато роботи, я говорив про це з першого дня.'
# count = 0
# for i in text:
#     if i == '.' or i == '!' or i == '?':
#         count+=1
# print('в тексті',count, 'речень')

# task 2

# polindrom = input('polindron : ')
# if polindrom == polindrom[::-1]:
#     print('слово', polindrom, 'є поліндром')
# elif polindrom == polindrom:
#     print('слово', polindrom,'не є поліндромом')

